pchwalek/buzzcam/STM32_WPAN/App/app_thread.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * File Name          : App/app_thread.c
 * Description        : Thread Application.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "utilities_common.h"
#include "app_entry.h"
#include "dbg_trace.h"
#include "app_thread.h"
#include "stm32wbxx_core_interface_def.h"
#include "openthread_api_wb.h"
#include "shci.h"
#include "stm_logging.h"
#include "app_conf.h"
#include "stm32_lpm.h"
#include "cmsis_os.h"
#if (CFG_USB_INTERFACE_ENABLE != 0)
#include "vcp.h"
#include "vcp_conf.h"
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

/* Private includes -----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "coap.h"
#include "main.h"
#include "queue.h"
#include "pb.h"
#include "pb_decode.h"
#include "pb_encode.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
#define C_SIZE_CMD_STRING       256U
#define C_PANID                 0x1234U
#define C_CHANNEL_NB            23U

/* FreeRtos stacks attributes */
const osThreadAttr_t ThreadMsgM0ToM4Process_attr = { .name =
		CFG_THREAD_MSG_M0_TO_M4_PROCESS_NAME, .attr_bits =
				CFG_THREAD_MSG_M0_TO_M4_PROCESS_ATTR_BITS, .cb_mem =
						CFG_THREAD_MSG_M0_TO_M4_PROCESS_CB_MEM, .cb_size =
								CFG_THREAD_MSG_M0_TO_M4_PROCESS_CB_SIZE, .stack_mem =
										CFG_THREAD_MSG_M0_TO_M4_PROCESS_STACK_MEM, .priority =
												CFG_THREAD_MSG_M0_TO_M4_PROCESS_PRIORITY, .stack_size =
														CFG_THREAD_MSG_M0_TO_M4_PROCESS_STACK_SIZE };

const osThreadAttr_t ThreadCliProcess_attr = { .name =
		CFG_THREAD_CLI_PROCESS_NAME, .attr_bits =
				CFG_THREAD_CLI_PROCESS_ATTR_BITS, .cb_mem =
						CFG_THREAD_CLI_PROCESS_CB_MEM,
						.cb_size = CFG_THREAD_CLI_PROCESS_CB_SIZE, .stack_mem =
								CFG_THREAD_CLI_PROCESS_STACK_MEM, .priority =
										CFG_THREAD_CLI_PROCESS_PRIORITY, .stack_size =
												CFG_THREAD_CLI_PROCESS_STACK_SIZE };

/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */
#define C_RESSOURCE             "buzz"
#define C_CONFIG_RESSOURCE		"config"

#define COAP_SEND_TIMEOUT               (5*100*1000/CFG_TS_TICK_VAL) /**< 1s */
#define THREAD_CHANGE_MODE_TIMEOUT      (1*1000*1000/CFG_TS_TICK_VAL) /**< 1s */
#define THREAD_LINK_POLL_PERIOD         (5*1000*1000/CFG_TS_TICK_VAL) /**< 5s */

#define OT_AUTOSTART_MODE 1 // Automatic OT start and COAP after reset
// ste to 0 for GRL testing

static QueueHandle_t MoNotifQueue;

/* USER CODE END PM */

/* Private function prototypes -----------------------------------------------*/
static void APP_THREAD_CheckWirelessFirmwareInfo(void);
static void APP_THREAD_DeviceConfig(void);
static void APP_THREAD_StateNotif(uint32_t NotifFlags, void *pContext);
static void APP_THREAD_TraceError(const char *pMess, uint32_t ErrCode);
#if (CFG_FULL_LOW_POWER == 0)
static void Send_CLI_To_M0(void);
#endif /* (CFG_FULL_LOW_POWER == 0) */
static void Send_CLI_Ack_For_OT(void);
static void HostTxCb(void);
static void Wait_Getting_Ack_From_M0(void);
static void Receive_Ack_From_M0(void);
static void Receive_Notification_From_M0(void);
#if (CFG_HW_LPUART1_ENABLED == 1)
extern void MX_LPUART1_UART_Init(void);
#endif
#if (CFG_HW_USART1_ENABLED == 1)
extern void MX_USART1_UART_Init(void);
#endif
#if (CFG_USB_INTERFACE_ENABLE != 0)
static uint32_t ProcessCmdString(uint8_t* buf , uint32_t len);
#else
#if (CFG_FULL_LOW_POWER == 0)
static void RxCpltCallback(void);
#endif /* (CFG_FULL_LOW_POWER == 0) */
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

/* FreeRTos wrapper functions */
static void APP_THREAD_FreeRTOSProcessMsgM0ToM4Task(void *argument);
#if (CFG_FULL_LOW_POWER == 0)
static void APP_THREAD_FreeRTOSSendCLIToM0Task(void *argument);
#endif /* (CFG_FULL_LOW_POWER == 0) */

/* USER CODE BEGIN PFP */
void createConfigThread(void *pvParameter1, uint32_t ulParameter2);
//void vProcessInterface( void *pvParameter1, uint32_t ulParameter2 );

static void APP_THREAD_SendCoapMsg(void);
static void APP_THREAD_SendCoapMulticastRequest(uint8_t command);
static void APP_THREAD_CoapRequestHandler(void *pContext, otMessage *pMessage,
		const otMessageInfo *pMessageInfo);
static void APP_THREAD_CoapConfigHandler(void *pContext, otMessage *pMessage,
		const otMessageInfo *pMessageInfo);
static void APP_THREAD_SetSleepyEndDeviceMode(void);
static void APP_THREAD_CoapTimingElapsed(void);

void updateTable(uwb_range_t newEntry);

static void APP_THREAD_CoapSendRequest(otCoapResource *aCoapRessource,
		otCoapType aCoapType, otCoapCode aCoapCode, const char *aStringAddress,
		const otIp6Address *aPeerAddress, uint8_t *aPayload, uint16_t Size,
		otCoapResponseHandler aHandler, void *aContext);

//static void ot_StatusNot( ot_TL_CmdStatus_t status );
osMutexId_t MtxOtCmdId;
osMutexId_t MtxOtAckId;

static configChange configMsg;

static void ot_Ack(ot_TL_CmdStatus_t status);

void Ot_Cmd_TransferWithNotif(void);

void sendConfig(otIp6Address addr);

static colorConfig color;
/* USER CODE END PFP */

/* Private variables -----------------------------------------------*/
#if (CFG_USB_INTERFACE_ENABLE != 0)
static uint8_t TmpString[C_SIZE_CMD_STRING];
static uint8_t VcpRxBuffer[sizeof(TL_CmdSerial_t)];        /* Received Data over USB are stored in this buffer */
static uint8_t VcpTxBuffer[sizeof(TL_EvtPacket_t) + 254U]; /* Transmit buffer over USB */
#else
#if (CFG_FULL_LOW_POWER == 0)
static uint8_t aRxBuffer[C_SIZE_CMD_STRING];
#endif /* (CFG_FULL_LOW_POWER == 0) */
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

#if (CFG_FULL_LOW_POWER == 0)
static uint8_t CommandString[C_SIZE_CMD_STRING];
#endif /* (CFG_FULL_LOW_POWER == 0) */
static __IO uint16_t indexReceiveChar = 0;
static __IO uint16_t CptReceiveCmdFromUser = 0;

