pchwalek/buzzcam/STM32_WPAN/App/app_thread.c
	/* USER CODE BEGIN DEVICECONFIG */
	error = otCoapStart(NULL, OT_DEFAULT_COAP_PORT);
	if (error != OT_ERROR_NONE) {
		APP_THREAD_Error(ERR_THREAD_COAP_START, error);
	}
	/* Add COAP resources */
	otCoapAddResource(NULL, &OT_Ressource);
	otCoapAddResource(NULL, &OT_ConfigRessource);

	coapSetup = 1;

	//  if(configPacket.payload.config_packet.network_state.master_node){
	//
	//  }
	//
	//  else if(configPacket.payload.config_packet.network_state.slave_sync){
	//
	//  }
	/* USER CODE END DEVICECONFIG */
}

/**
 * @brief Thread notification when the state changes.
 * @param  aFlags  : Define the item that has been modified
 *         aContext: Context
 *
 * @retval None
 */
static void APP_THREAD_StateNotif(uint32_t NotifFlags, void *pContext) {
	/* Prevent unused argument(s) compilation warning */
	UNUSED(pContext);

	/* USER CODE BEGIN APP_THREAD_STATENOTIF */

	/* USER CODE END APP_THREAD_STATENOTIF */

	if ((NotifFlags & (uint32_t) OT_CHANGED_THREAD_ROLE)
			== (uint32_t) OT_CHANGED_THREAD_ROLE) {
		switch (otThreadGetDeviceRole(NULL)) {
		case OT_DEVICE_ROLE_DISABLED:
			/* USER CODE BEGIN OT_DEVICE_ROLE_DISABLED */
			prev_master_uid = 0;
			local_uwbInfo.has_uwb = 0;
			/* USER CODE END OT_DEVICE_ROLE_DISABLED */
			break;
		case OT_DEVICE_ROLE_DETACHED:
			/* USER CODE BEGIN OT_DEVICE_ROLE_DETACHED */
			prev_master_uid = 0;
			local_uwbInfo.has_uwb = 0;
			/* USER CODE END OT_DEVICE_ROLE_DETACHED */
			break;
		case OT_DEVICE_ROLE_CHILD:
			/* USER CODE BEGIN OT_DEVICE_ROLE_CHILD */
			/* request info from onboard UWB node */
			if(local_uwbInfo.has_uwb == 0){
				osThreadFlagsSet(uwbMessageTaskId, UWB_GET_INFO);
			}
			if((configPacket.payload.config_packet.network_state.master_node == 0) &&
					(configPacket.payload.config_packet.network_state.slave_sync == 1)){
				if(prev_master_uid == 0) alertMaster(); // if never received a packet from master
			}
			/* USER CODE END OT_DEVICE_ROLE_CHILD */
			break;
		case OT_DEVICE_ROLE_ROUTER:
			/* USER CODE BEGIN OT_DEVICE_ROLE_ROUTER */
			/* request info from onboard UWB node */
			if(local_uwbInfo.has_uwb == 0){
				osThreadFlagsSet(uwbMessageTaskId, UWB_GET_INFO);
			}
			if((configPacket.payload.config_packet.network_state.master_node == 0) &&
					(configPacket.payload.config_packet.network_state.slave_sync == 1)){
				if(prev_master_uid == 0) alertMaster(); // if never received a packet from master
			}
			break;
		case OT_DEVICE_ROLE_LEADER:
			/* USER CODE BEGIN OT_DEVICE_ROLE_LEADER */
			/* request info from onboard UWB node */
			if(local_uwbInfo.has_uwb == 0){
				osThreadFlagsSet(uwbMessageTaskId, UWB_GET_INFO);
			}
			if((configPacket.payload.config_packet.network_state.master_node == 0) &&
					(configPacket.payload.config_packet.network_state.slave_sync == 1)){
				if(prev_master_uid == 0) alertMaster(); // if never received a packet from master
			}else{

			}

			break;
		default:
			/* USER CODE BEGIN DEFAULT */

			/* USER CODE END DEFAULT */
			break;
		}
	}
}

/**
 * @brief  Warn the user that an error has occurred.In this case,
 *         the LEDs on the Board will start blinking.
 *
 * @param  pMess  : Message associated to the error.
 * @param  ErrCode: Error code associated to the module (OpenThread or other module if any)
 * @retval None
 */
static void APP_THREAD_TraceError(const char *pMess, uint32_t ErrCode) {
	/* USER CODE BEGIN TRACE_ERROR */

	/* USER CODE END TRACE_ERROR */
}

/**
 * @brief Check if the Coprocessor Wireless Firmware loaded supports Thread
 *        and display associated informations
 * @param  None
 * @retval None
 */
static void APP_THREAD_CheckWirelessFirmwareInfo(void) {
	WirelessFwInfo_t wireless_info_instance;
	WirelessFwInfo_t *p_wireless_info = &wireless_info_instance;

	if (SHCI_GetWirelessFwInfo(p_wireless_info) != SHCI_Success) {
		APP_THREAD_Error((uint32_t) ERR_THREAD_CHECK_WIRELESS,
				(uint32_t) ERR_INTERFACE_FATAL);
	} else {
		APP_DBG("**********************************************************");
		APP_DBG("WIRELESS COPROCESSOR FW:");
		/* Print version */
		APP_DBG("VERSION ID = %d.%d.%d", p_wireless_info->VersionMajor,
				p_wireless_info->VersionMinor, p_wireless_info->VersionSub);

		switch (p_wireless_info->StackType) {
		case INFO_STACK_TYPE_THREAD_FTD:
			APP_DBG("FW Type : Thread FTD")
			;
			break;
		case INFO_STACK_TYPE_THREAD_MTD:
			APP_DBG("FW Type : Thread MTD")
			;
			break;
		case INFO_STACK_TYPE_BLE_THREAD_FTD_STATIC:
			APP_DBG("FW Type : Static Concurrent Mode BLE/Thread")
			;
			break;
		case INFO_STACK_TYPE_BLE_THREAD_FTD_DYNAMIC:
			APP_DBG("FW Type : Static Concurrent Mode BLE/Thread")
			;
			break;
		default:
			/* No Thread device supported ! */
			APP_THREAD_Error((uint32_t) ERR_THREAD_CHECK_WIRELESS,
					(uint32_t) ERR_INTERFACE_FATAL);
			break;
		}
		APP_DBG("**********************************************************");
	}
}

/*************************************************************
 *
 * FREERTOS WRAPPER FUNCTIONS
 *
 *************************************************************/
static void APP_THREAD_FreeRTOSProcessMsgM0ToM4Task(void *argument) {
	UNUSED(argument);
	uint8_t NotUsed = 0;

	for (;;) {
		/* USER CODE BEGIN APP_THREAD_FREERTOS_PROCESS_MSG_M0_TO_M4_1 */

		/* USER END END APP_THREAD_FREERTOS_PROCESS_MSG_M0_TO_M4_1 */
		//    osThreadFlagsWait(1,osFlagsWaitAll,osWaitForever);
		//    APP_THREAD_ProcessMsgM0ToM4();
		xQueueReceive(MoNotifQueue, &NotUsed, portMAX_DELAY);

		//	while(g_ot_notification_allowed == 0){
		//		osDelay(1);
		//	}

		while (waitingForAck && !FlagReceiveAckFromM0) {
			osDelay(1);
		}

		if (osOK != osMutexAcquire(MtxHciId, osWaitForever)) {
			Error_Handler();
		}
		if (osOK != osMutexRelease(MtxHciId)) {
			Error_Handler();
		}

		if (uxQueueMessagesWaiting(MoNotifQueue) > 1U) {
			APP_THREAD_Error(ERR_REC_MULTI_MSG_FROM_M0, 0);
		} else {
			OpenThread_CallBack_Processing();
		}
		/* USER CODE BEGIN APP_THREAD_FREERTOS_PROCESS_MSG_M0_TO_M4_2 */
		//    FlagCmdProcessingFromM0 = 1;
		/* USER END END APP_THREAD_FREERTOS_PROCESS_MSG_M0_TO_M4_2 */
	}
}

#if (CFG_FULL_LOW_POWER == 0)
static void APP_THREAD_FreeRTOSSendCLIToM0Task(void *argument)
{
	UNUSED(argument);
	for(;;)
	{
		/* USER CODE BEGIN APP_THREAD_FREERTOS_SEND_CLI_TO_M0_1 */

		/* USER END END APP_THREAD_FREERTOS_SEND_CLI_TO_M0_1 */
		osThreadFlagsWait(1,osFlagsWaitAll,osWaitForever);
		// Send_CLI_To_M0();
		/* USER CODE BEGIN APP_THREAD_FREERTOS_SEND_CLI_TO_M0_2 */

		/* USER END END APP_THREAD_FREERTOS_SEND_CLI_TO_M0_2 */
	}
}
#endif /* (CFG_FULL_LOW_POWER == 0) */

