pchwalek/buzzcam/STM32_WPAN/App/app_thread.c
	/* Prevent unused argument(s) compilation warning */
	UNUSED(Otbuffer);

	Receive_Ack_From_M0();

	/* Does not allow OpenThread M0 to M4 notification */
	g_ot_notification_allowed = 0U;
}

/**
 * @brief  This function is called when notification from M0+ is received.
 *
 * @param   Notbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void TL_THREAD_NotReceived(TL_EvtPacket_t *Notbuffer) {
	p_thread_notif_M0_to_M4 = Notbuffer;

	Receive_Notification_From_M0();
}

/**
 * @brief  This function is called before sending any ot command to the M0
 *         core. The purpose of this function is to be able to check if
 *         there are no notifications coming from the M0 core which are
 *         pending before sending a new ot command.
 * @param  None
 * @retval None
 */
void Pre_OtCmdProcessing(void) {
	/* We want to only run this if no other thread
	 * is running an M0 command
	 *
	 * Possible threads:
	 *  ShciUserEvtProcessId
	 *  HciUserEvtProcessId
	 *  AdvUpdateProcessId
	 *  OsTaskMsgM0ToM4Id (APP_THREAD_FreeRTOSProcessMsgM0ToM4Task)
	 *
	 *  If no M0 commands are run, we can trigger
	 *  OsTaskMsgM0ToM4Id
	 */

	//	while(CptReceiveMsgFromM0 > 0);
	//	  while (FlagCmdProcessingFromM0 == 0)
	//	  {
	//	//	  osDelay(1);
	//	  }
	//	  FlagCmdProcessingFromM0 = 0;
	//	if(xTaskGetSchedulerState() == taskSCHEDULER_RUNNING){
	//		FlagCmdProcessingFromM0 = 1;
	//	  ot_StatusNot(ot_TL_CmdBusy);
	//	}
	//	osThreadYield();
	//	ot_StatusNot(ot_TL_CmdBusy);
	//
	//	osThreadFlagsSet(OsTaskMsgM0ToM4Id,1);
	//		while(bluetoothCmdBusy == 1){
	//
	//		}
	//	  osMutexAcquire(MtxHciId, osWaitForever);
	//	osMutexAcquire(MtxThreadId, osWaitForever);
	//    if(osOK != osMutexAcquire(MtxHciId, osWaitForever)){
	//    	Error_Handler();
	//    }
	ot_StatusNot(ot_TL_CmdBusy);

	/* only OsTaskMsgM0ToM4Id should be allowed to run while
	 * the other tasks are disabled
	 */

}

/**
 * @brief  This function waits for getting an acknowledgment from the M0.
 *
 * @param  None
 * @retval None
 */

static void Wait_Getting_Ack_From_M0(void) {
	// called in SHCI process
	waitingForAck = 1;
	while (FlagReceiveAckFromM0 == 0) {
	}
	FlagReceiveAckFromM0 = 0;
	waitingForAck = 0;

	//    if(osOK != osMutexRelease(MtxHciId)){
	//    	Error_Handler();
	//    }
	ot_StatusNot(ot_TL_CmdAvailable);
}

/**
 * @brief  Receive an acknowledgment from the M0+ core.
 *         Each command send by the M4 to the M0 are acknowledged.
 *         This function is called under interrupt.
 * @param  None
 * @retval None
 */
static void Receive_Ack_From_M0(void) {
	// Called from ISR!!
	FlagReceiveAckFromM0 = 1;
	//	 ot_Ack(ot_TL_CmdAvailable);
	//	  osThreadFlagsSet(OsTaskMsgM0ToM4Id,1);

	//  FlagReceiveAckFromM0 = 1;
	//  FlagCmdProcessingFromM0 = 0;

}

/**
 * @brief  Receive a notification from the M0+ through the IPCC.
 *         This function is called under interrupt.
 * @param  None
 * @retval None
 */
static void Receive_Notification_From_M0(void) {
	// From ISR!

	/* The xHigherPriorityTaskWoken parameter must be initialized to pdFALSE as
	 it will get set to pdTRUE inside the interrupt safe API function if a
	 context switch is required. */
	BaseType_t xHigherPriorityTaskWoken = pdFALSE;

	uint8_t NotUsed = 0;
	xQueueSendToFrontFromISR(MoNotifQueue, &NotUsed, &xHigherPriorityTaskWoken);

	/* Pass the xHigherPriorityTaskWoken value into portEND_SWITCHING_ISR(). If
	 xHigherPriorityTaskWoken was set to pdTRUE inside xSemaphoreGiveFromISR()
	 then calling portEND_SWITCHING_ISR() will request a context switch. If
	 xHigherPriorityTaskWoken is still pdFALSE then calling
	 portEND_SWITCHING_ISR() will have no effect */
	portEND_SWITCHING_ISR(xHigherPriorityTaskWoken);
}

#if (CFG_USB_INTERFACE_ENABLE != 0)
#else
#if (CFG_FULL_LOW_POWER == 0)
static void RxCpltCallback(void)
{
	/* Filling buffer and wait for '\r' char */
	if (indexReceiveChar < C_SIZE_CMD_STRING)
	{
		CommandString[indexReceiveChar++] = aRxBuffer[0];
		if (aRxBuffer[0] == '\r')
		{
			CptReceiveCmdFromUser = 1U;

			/* UART task scheduling*/
			osThreadFlagsSet(OsTaskCliId,1);
		}
	}

	/* Once a character has been sent, put back the device in reception mode */
	//  HW_UART_Receive_IT(CFG_CLI_UART, aRxBuffer, 1U, RxCpltCallback);
}
#endif /* (CFG_FULL_LOW_POWER == 0) */
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

#if (CFG_USB_INTERFACE_ENABLE != 0)
/**
 * @brief Process the command strings.
 *        As soon as a complete command string has been received, the task
 *        in charge of sending the command to the M0 is scheduled
 * @param  None
 * @retval None
 */
static uint32_t  ProcessCmdString( uint8_t* buf , uint32_t len )
{
	uint32_t i,j,tmp_start;
	tmp_start = 0;
	uint32_t res = 0;

	i= 0;
	while ((buf[i] != '\r') && (i < len))
	{
		i++;
	}

	if (i != len)
	{
		memcpy(CommandString, buf,(i+1));
		indexReceiveChar = i + 1U; /* Length of the buffer containing the command string */
		osThreadFlagsSet(OsTaskCliId,1)
		tmp_start = i;
		for (j = 0; j < (len - tmp_start - 1U) ; j++)
		{
			buf[j] = buf[tmp_start + j + 1U];
		}
		res = len - tmp_start - 1U;
	}
	else
	{
		res = len;
	}
	return res; /* Remaining characters in the temporary buffer */
}
#endif/* (CFG_USB_INTERFACE_ENABLE != 0) */

#if (CFG_FULL_LOW_POWER == 0)
/**
 * @brief Process sends receive CLI command to M0.
 * @param  None
 * @retval None
 */
static void Send_CLI_To_M0(void)
{
	memset(ThreadCliCmdBuffer.cmdserial.cmd.payload, 0x0U, 255U);
	memcpy(ThreadCliCmdBuffer.cmdserial.cmd.payload, CommandString, indexReceiveChar);
	ThreadCliCmdBuffer.cmdserial.cmd.plen = indexReceiveChar;
	ThreadCliCmdBuffer.cmdserial.cmd.cmdcode = 0x0;

	/* Clear receive buffer, character counter and command complete */
	CptReceiveCmdFromUser = 0;
	indexReceiveChar = 0;
	memset(CommandString, 0, C_SIZE_CMD_STRING);

	TL_CLI_SendCmd();
}
#endif /* (CFG_FULL_LOW_POWER == 0) */

/**
 * @brief Send notification for CLI TL Channel.
 * @param  None
 * @retval None
 */
static void Send_CLI_Ack_For_OT(void) {

	/* Notify M0 that characters have been sent to UART */
	TL_THREAD_CliSendAck();
}

/**
 * @brief Perform initialization of CLI UART interface.
 * @param  None
 * @retval None
 */
void APP_THREAD_Init_UART_CLI(void) {
#if (CFG_FULL_LOW_POWER == 0)
	OsTaskCliId = osThreadNew(APP_THREAD_FreeRTOSSendCLIToM0Task, NULL,&ThreadCliProcess_attr);
#endif /* (CFG_FULL_LOW_POWER == 0) */

#if (CFG_USB_INTERFACE_ENABLE != 0)
#else
#if (CFG_FULL_LOW_POWER == 0)
	//  MX_USART1_UART_Init();
	//  HW_UART_Receive_IT(CFG_CLI_UART, aRxBuffer, 1, RxCpltCallback);
#endif /* (CFG_FULL_LOW_POWER == 0) */
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */
}

/**
 * @brief Perform initialization of TL for THREAD.
 * @param  None
 * @retval None
 */
void APP_THREAD_TL_THREAD_INIT(void) {
	//  ThreadConfigBuffer.p_ThreadOtCmdRspBuffer = (uint8_t*)&ThreadOtCmdBuffer;
	//  ThreadConfigBuffer.p_ThreadNotAckBuffer = (uint8_t*)ThreadNotifRspEvtBuffer;
	//  ThreadConfigBuffer.p_ThreadCliRspBuffer = (uint8_t*)&ThreadCliCmdBuffer;

