pchwalek/buzzcam/STM32_WPAN/App/app_thread.c
	ThreadConfigBuffer.p_ThreadOtCmdRspBuffer = (uint8_t*) &ThreadOtCmdBuffer;
	ThreadConfigBuffer.p_ThreadNotAckBuffer =
			(uint8_t*) ThreadNotifRspEvtBuffer;
	ThreadConfigBuffer.p_ThreadCliRspBuffer = (uint8_t*) &ThreadCliCmdBuffer;
	ThreadConfigBuffer.p_ThreadCliNotBuffer = (uint8_t*) &ThreadCliNotBuffer;

	TL_THREAD_Init(&ThreadConfigBuffer);
}

/**
 * @brief  This function is called when notification on CLI TL Channel from M0+ is received.
 *
 * @param   Notbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void TL_THREAD_CliNotReceived(TL_EvtPacket_t *Notbuffer) {
	TL_CmdPacket_t *l_CliBuffer = (TL_CmdPacket_t*) Notbuffer;
	uint8_t l_size = l_CliBuffer->cmdserial.cmd.plen;

	/* WORKAROUND: if string to output is "> " then respond directly to M0 and do not output it */
	if (strcmp((const char*) l_CliBuffer->cmdserial.cmd.payload, "> ") != 0) {
		/* Write to CLI UART */
#if (CFG_USB_INTERFACE_ENABLE != 0)
		VCP_SendData( l_CliBuffer->cmdserial.cmd.payload, l_size, HostTxCb);
#else
		//    HW_UART_Transmit_IT(CFG_CLI_UART, l_CliBuffer->cmdserial.cmd.payload, l_size, HostTxCb);
#endif /*USAGE_OF_VCP */
	} else {
		Send_CLI_Ack_For_OT();
	}
}

/**
 * @brief  End of transfer callback for CLI UART sending.
 *
 * @param   Notbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void HostTxCb(void) {
	Send_CLI_Ack_For_OT();
}

/**
 * @brief Process the messages coming from the M0.
 * @param  None
 * @retval None
 */
//void APP_THREAD_ProcessMsgM0ToM4(void)
//{
//  if (CptReceiveMsgFromM0 != 0)
//  {
//    /* If CptReceiveMsgFromM0 is > 1. it means that we did not serve all the events from the radio */
//    if (CptReceiveMsgFromM0 > 1U)
//    {
//      APP_THREAD_Error(ERR_REC_MULTI_MSG_FROM_M0, 0);
//    }
//    else
//    {
//      OpenThread_CallBack_Processing();
//    }
//    /* Reset counter */
//    CptReceiveMsgFromM0 = 0;
//  }
//}
#if (CFG_USB_INTERFACE_ENABLE != 0)
/**
 * @brief  This function is called when thereare some data coming
 *         from the Hyperterminal via the USB port
 *         Data received over USB OUT endpoint are sent over CDC interface
 *         through this function.
 * @param  Buf: Buffer of data received
 * @param  Len: Number of data received (in bytes)
 * @retval Number of characters remaining in the buffer and not yet processed
 */
void VCP_DataReceived(uint8_t* Buf , uint32_t *Len)
{
	uint32_t i,flag_continue_checking = TRUE;
	uint32_t char_remaining = 0;
	static uint32_t len_total = 0;

	/* Copy the characteres in the temporary buffer */
	for (i = 0; i < *Len; i++)
	{
		TmpString[len_total++] = Buf[i];
	}

	/* Process the buffer commands one by one     */
	/* A command is limited by a \r caracaters    */
	while (flag_continue_checking == TRUE)
	{
		char_remaining = ProcessCmdString(TmpString,len_total);
		/* If char_remaining is equal to len_total, it means that the command string is not yet
		 * completed.
		 * If char_remaining is equal to 0, it means that the command string has
		 * been entirely processed.
		 */
		if ((char_remaining == 0) || (char_remaining == len_total))
		{
			flag_continue_checking = FALSE;
		}
		len_total = char_remaining;
	}
}
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
/**
 * @brief Handler called when the server receives a COAP request.
 * @param pContext : Context
 * @param pMessage : Message
 * @param pMessageInfo : Message information
 * @retval None
 */
static void APP_THREAD_CoapRequestHandler(void *pContext, otMessage *pMessage,
		const otMessageInfo *pMessageInfo) {
	do {
		//    if (otCoapMessageGetType(pMessage) != OT_COAP_TYPE_NON_CONFIRMABLE)
		//    {
		//      break;
		//    }

		//    if (otCoapMessageGetCode(pMessage) != OT_COAP_CODE_PUT)
		//    {
		//      break;
		//    }
		uint16_t receivedBytes;
		receivedBytes = otMessageRead(pMessage, otMessageGetOffset(pMessage),
				PayloadRead, sizeof(PayloadRead));
		if (strncmp(PayloadRead, "light", 5) == 0) {
			toggledGreen();
			//			osThreadFlagsSet(AdvUpdateProcessId, 1);

		} else {
			//		  printf("The string does not start with 'test'.\n");
		}

		//    if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &OT_ReceivedCommand, 1U) != 1U)
		//    {
		//      APP_THREAD_Error(ERR_THREAD_MESSAGE_READ, 0);
		//    }

		if (OT_ReceivedCommand == 1U) {
			//      BSP_LED_Toggle(LED3);
			//      APP_DBG("**** Recept COAP nb **** %d ",DebugRxCoapCpt++);
		}

		/* If Message is Confirmable, send response */
		if (otCoapMessageGetType(pMessage) == OT_COAP_TYPE_CONFIRMABLE) {
			APP_THREAD_CoapSendDataResponse(pMessage, pMessageInfo);
		}

	} while (false);
}


static void APP_THREAD_CoapConfigHandler(void *pContext, otMessage *pMessage,
		const otMessageInfo *pMessageInfo) {
	do {
		//    if (otCoapMessageGetType(pMessage) != OT_COAP_TYPE_NON_CONFIRMABLE)
		//    {
		//      break;
		//    }

		if (otCoapMessageGetCode(pMessage) == OT_COAP_CODE_PUT) {

			uint16_t receivedBytes;
			receivedBytes = otMessageRead(pMessage,
					otMessageGetOffset(pMessage), buffer, sizeof(buffer));

			uint8_t status;
			/* Create a stream that reads from the buffer. */
			pb_istream_t stream = pb_istream_from_buffer(buffer, receivedBytes);
			/* Now we are ready to decode the message. */
			status = pb_decode(&stream, PACKET_FIELDS, &rxPacket);

			if (status) {

				switch (rxPacket.which_payload) {
				case PACKET_MARK_PACKET_TAG:
					//					state = osThreadGetState(markThreadId);
					//					if( (state != osThreadReady) || (state != osThreadRunning) || (state != osThreadInactive) || (state != osThreadBlocked) ){
					//						markThreadId = osThreadNew(triggerMark, &rxPacket.payload.mark_packet, &markTask_attributes);
					//					}
					break;
				case PACKET_SYSTEM_INFO_PACKET_TAG:
					break;
				case PACKET_CONFIG_PACKET_TAG:
					/* only update config if in slave mode and coming from master*/
					if (configPacket.payload.config_packet.network_state.slave_sync &&
						(rxPacket.payload.config_packet.network_state.master_node == 1)) {

						/* we require a header from the master */
						if(!rxPacket.has_header) break;

