pchwalek/buzzcam/STM32_WPAN/App/app_thread.c
						/* check if we already received this packet before */
						if( (prev_master_epoch == rxPacket.header.epoch) &&
								(prev_master_uid == rxPacket.header.system_uid) &&
								(configPacket.payload.config_packet.enable_recording == rxPacket.payload.config_packet.enable_recording)){
							break;
						}

						/* if never received a config before, likely this is a fresh slave so send UWB info */
						if(prev_master_uid == 0) sendUWB_InfoToNode((peer_address_t*) &local_uwbInfo.uwb.address, pMessageInfo->mPeerAddr);

						prev_master_epoch = rxPacket.header.epoch;
						prev_master_uid = rxPacket.header.system_uid;

						/* update internal timestamp if a valid timestamp received */
						if(rxPacket.header.epoch > 1707866274000){
							updateRTC_MS(rxPacket.header.epoch);
						}

//						sendUWB_InfoToNode(
//								(peer_address_t*) &local_uwbInfo.uwb.address,
//								pMessageInfo->mPeerAddr);

						//						osThreadState_t state = osThreadGetState(configThreadId);
						//						if( (state != osThreadReady) || (state != osThreadRunning) || (state != osThreadInactive) || (state != osThreadBlocked) ){
						//							xTimerPendFunctionCallFromISR(createConfigThread, &rxPacket.payload.config_packet, NULL, pdFALSE);
						//						}
						osThreadState_t state = osThreadGetState(
								configThreadId);
						if ((state != osThreadReady)
								|| (state != osThreadRunning)
								|| (state != osThreadInactive)
								|| (state != osThreadBlocked)) {
							memcpy(&configMsg.config, &rxPacket.payload.config_packet, sizeof(config_packet_t));
							configMsg.fromMaster = 1;
							configThreadId = osThreadNew(updateSystemConfig,
									&configMsg,
									&configTask_attributes);
						}
					}

					/* failure conditon: if another master node is broadcasting, demote yourself to slave_node */
					else if ((rxPacket.payload.config_packet.network_state.master_node
							== 1)
							&& (configPacket.payload.config_packet.network_state.master_node
									== 1)) {
						configPacket.payload.config_packet.network_state.slave_sync =
								1;
						configPacket.payload.config_packet.network_state.master_node =
								0;

						//						osThreadState_t state = osThreadGetState(configThreadId);
						//						if( (state != osThreadReady) || (state != osThreadRunning) || (state != osThreadInactive) || (state != osThreadBlocked) ){
						//							xTimerPendFunctionCallFromISR(createConfigThread, &rxPacket.payload.config_packet, NULL, pdFALSE);
						//						}
						osThreadState_t state = osThreadGetState(
								configThreadId);
						if ((state != osThreadReady)
								|| (state != osThreadRunning)
								|| (state != osThreadInactive)
								|| (state != osThreadBlocked)) {
							memcpy(&configMsg.config, &rxPacket.payload.config_packet, sizeof(config_packet_t));
							configMsg.fromMaster = 1;
							configThreadId = osThreadNew(updateSystemConfig,
									&configMsg,
									&configTask_attributes);
						}
					}
					break;
				case PACKET_SPECIAL_FUNCTION_TAG:
					switch (rxPacket.payload.special_function.which_payload) {
					case SPECIAL_FUNCTION_FORMAT_SDCARD_TAG:
						break;
					case SPECIAL_FUNCTION_CAMERA_CONTROL_TAG:
						if (rxPacket.payload.special_function.payload.camera_control.capture) {
							//todo: trigger any connected cameras
						} else if (rxPacket.payload.special_function.payload.camera_control.pair_with_nearby_cameras) {
							//todo: put device in pairing mode for any nearby cameras
						} else if (rxPacket.payload.special_function.payload.camera_control.wakeup_cameras) {
							//todo: wakeup any sleeping cameras
						}
						break;
					case SPECIAL_FUNCTION_UWB_PACKET_TAG:
						if (rxPacket.payload.special_function.payload.uwb_packet.start_ranging) {
							//todo: turn on UWB if not already on
						}
						if (rxPacket.payload.special_function.payload.uwb_packet.turn_on_uwb) {
							//todo: turn on UWB if not already on
						}
						if (rxPacket.payload.special_function.payload.uwb_packet.ranges_count
								> 0) {
							// update UWB entry
							for (int i = 0; i++;
									i < rxPacket.payload.special_function.payload.uwb_packet.ranges_count) {
								updateRangeTableUWB(rxPacket.header.system_uid,
										rxPacket.payload.special_function.payload.uwb_packet.ranges[i].system_uid,
										rxPacket.payload.special_function.payload.uwb_packet.ranges[i].range,
										rxPacket.payload.special_function.payload.uwb_packet.ranges[i].std_dev);
							}

							//								updateTable(rxPacket.payload.special_function.payload.uwb_packet.ranges[0]);
						}
						break;
					case SPECIAL_FUNCTION_OPENTHREAD_SYNC_TIME_TAG:
						if (configPacket.payload.config_packet.network_state.slave_sync) {
							if (rxPacket.header.epoch < 1707859083) {
								updateRTC_MS(rxPacket.header.epoch);
							}
							color.blue_val = 100;
							color.green_val = 100;
							color.red_val = 100;
							color.duration = 500;
							osMessageQueuePut(ledSeqQueueId, &color, 0, 0);
						}
						break;
					case SPECIAL_FUNCTION_MAG_CALIBRATION_TAG:
						break;
					case SPECIAL_FUNCTION_SLAVE_REQ_CONFIG_TAG:
						/* if a master node, unicast config and UWB information to a slave device */
						if (configPacket.payload.config_packet.network_state.master_node) {
							sendConfig(pMessageInfo->mPeerAddr);
							sendUWB_InfoToNode((peer_address_t*) &local_uwbInfo.uwb.address, pMessageInfo->mPeerAddr);
						}
						/* if slave device, unicast just uwb information */
						else{
							sendUWB_InfoToNode((peer_address_t*) &local_uwbInfo.uwb.address, pMessageInfo->mPeerAddr);
						}
						break;
					case SPECIAL_FUNCTION_TIMESTAMP_TAG:
						color.blue_val = 100;
						color.green_val = 100;
						color.red_val = 100;
						color.duration = 500;
						osMessageQueuePut(ledSeqQueueId, &color, 0, 0);
						break;
					case SPECIAL_FUNCTION_UWB_INFO_TAG:

						if(NEW_ENTRY == addInfotoTableUWB(
								&rxPacket.payload.special_function.payload.uwb_info)){
							sendUWB_InfoToNode((peer_address_t*) &local_uwbInfo.uwb.address, pMessageInfo->mPeerAddr);
						}

						break;
					default:
						break;
					}
					default:
						break;
				}

