pchwalek/buzzcam/STM32_WPAN/App/app_thread.c
			}

			if (strncmp(PayloadRead, "light", 5) == 0) {
				toggledGreen();
				//			osThreadFlagsSet(AdvUpdateProcessId, 1);

			} else {
				//		  printf("The string does not start with 'test'.\n");
			}

			break;
		}

		/* If Message is Confirmable, send response */
		if (otCoapMessageGetType(pMessage) == OT_COAP_TYPE_CONFIRMABLE) {
			APP_THREAD_CoapSendDataResponse(pMessage, pMessageInfo);
		}

	} while (false);

}

void updateTable(uwb_range_t newEntry) {

	for (int i = 0; i < sizeof(uwb_table); i++) {

		if (uwb_table.ranges[i].system_uid == newEntry.system_uid) {
			//update existing entry
			memcpy(&uwb_table.ranges[i], &newEntry, sizeof(newEntry));
			return;
		} else if (i == uwb_table.ranges_count) {
			//new entry
			memcpy(&uwb_table.ranges[i], &newEntry, sizeof(newEntry));
			uwb_table.ranges_count++;
			return;
		}
	}
}

void updateRangeTableUWB(uint32_t system_ID_1, uint32_t system_ID_2,
		float range, float std_dev) {
	for (int i = 0; i < MAX_UWB_RANGES; i++) {
		if ((rangesUWB[i].system_uid_1 == system_ID_1)
				&& (rangesUWB[i].system_uid_2 == system_ID_2)) {
			rangesUWB[i].range = range;
			rangesUWB[i].std_dev = std_dev;
			return;
		} else if ((rangesUWB[i].system_uid_1 == system_ID_1)
				&& (rangesUWB[i].system_uid_2 == system_ID_2)) {
			rangesUWB[i].range = range;
			rangesUWB[i].std_dev = std_dev;
			return;
		} else if (((rangesUWB[i].system_uid_1 == 0)
				&& (rangesUWB[i].system_uid_2 == 0))) {
			rangesUWB[i].system_uid_1 = system_ID_1;
			rangesUWB[i].system_uid_2 = system_ID_2;
			rangesUWB[i].range = range;
			rangesUWB[i].std_dev = std_dev;
			return;
		}
	}
}

uint32_t totalConnectedNodes(uwb_info_t *nodeInfo) {
	int i = 0;
	for (i = 0; i < MAX_UWB_RANGES; i++) {
		if (nodeInfo[i].system_uid == 0) {
			return (i);
		}
	}

	return MAX_UWB_RANGES;
}

/**
 * @brief This function acknowledges the data reception by sending an ACK
 *    back to the sender.
 * @param  pMessage coap message
 * @param  pMessageInfo message info pointer
 * @retval None
 */
static otMessage *pOT_MessageResponse = NULL;
static void APP_THREAD_CoapSendDataResponse(otMessage *pMessage,
		const otMessageInfo *pMessageInfo) {
	otError error = OT_ERROR_NONE;

	do {
		APP_DBG("APP_THREAD_CoapSendDataResponse");

		pOT_MessageResponse = otCoapNewMessage(NULL, NULL);
		if (pOT_MessageResponse == NULL) {
			APP_DBG("WARNING : pOT_MessageResponse = NULL ! -> exit now");
			break;
		}

		otCoapMessageInitResponse(pOT_MessageResponse, pMessage,
				OT_COAP_TYPE_ACKNOWLEDGMENT, OT_COAP_CODE_VALID);

		error = otCoapSendResponse(NULL, pOT_MessageResponse, pMessageInfo);
		if (error != OT_ERROR_NONE && pOT_MessageResponse != NULL) {
			otMessageFree(pOT_MessageResponse);
			//      APP_THREAD_Error(ERR_THREAD_COAP_DATA_RESPONSE,error);
		}
	} while (false);
}

/**
 * @brief Send a CoAP request with defined parameters.
 *
 * @param[in]  aCoapRessource   A pointer to a otCoapResource.
 * @param[in]  aCoapType        otCoapType.
 * @param[in]  aCoapCode        otCoapCode.
 * @param[in]  aStringAddress   A pointer to a NULL-terminated string representing the address. Example: "FF03::1" for Multicast.
 * @param[in]  aPeerAddress     A pointer to otIp6Address Peer Address.
 * @param[in]  aPayload         A pointer to payload.
 * @param[in]  aHandler         A pointer to CoAP response handler.
 * @param[in]  aContext         A pointer to application specific context.
 *
 * @retval none.
 */
static void APP_THREAD_CoapSendRequest(otCoapResource *aCoapRessource,
		otCoapType aCoapType, otCoapCode aCoapCode, const char *aStringAddress,
		const otIp6Address *aPeerAddress, uint8_t *aPayload, uint16_t Size,
		otCoapResponseHandler aHandler, void *aContext) {
	otError error = OT_ERROR_NONE;

	do {
		pOT_Message = otCoapNewMessage(NULL, NULL);
		if (pOT_Message == NULL) {
			APP_THREAD_Error(ERR_THREAD_COAP_NEW_MSG, error);
			break;
		}

		otCoapMessageInit(pOT_Message, aCoapType, aCoapCode);
		otCoapMessageAppendUriPathOptions(pOT_Message,
				aCoapRessource->mUriPath);
		otCoapMessageSetPayloadMarker(pOT_Message);

		if ((aPayload != NULL) && (Size > 0)) {
			error = otMessageAppend(pOT_Message, aPayload, Size);
			if (error != OT_ERROR_NONE) {
				Error_Handler();
				break;
			}
		} else {
			APP_DBG("APP_THREAD_CoapSendRequest: No payload passed");
		}

		memset(&OT_MessageInfo, 0, sizeof(OT_MessageInfo));
		OT_MessageInfo.mPeerPort = OT_DEFAULT_COAP_PORT;

		if ((aPeerAddress == NULL) && (aStringAddress != NULL)) {
			otIp6AddressFromString(aStringAddress, &OT_MessageInfo.mPeerAddr);
		} else if (aPeerAddress != NULL) {
			memcpy(&OT_MessageInfo.mPeerAddr, aPeerAddress,
					sizeof(OT_MessageInfo.mPeerAddr));
		} else {
			Error_Handler();
		}

		if (aCoapType == OT_COAP_TYPE_NON_CONFIRMABLE) {
			APP_DBG("aCoapType == OT_COAP_TYPE_NON_CONFIRMABLE");
			error = otCoapSendRequest(NULL, pOT_Message, &OT_MessageInfo,
					NULL,
					NULL);
		}
		if (aCoapType == OT_COAP_TYPE_CONFIRMABLE) {
			APP_DBG("aCoapType == OT_COAP_TYPE_CONFIRMABLE");
			error = otCoapSendRequest(NULL, pOT_Message, &OT_MessageInfo,
					aHandler, aContext);
		}
	} while (false);
	if (error != OT_ERROR_NONE && pOT_Message != NULL) {
		otMessageFree(pOT_Message);
		APP_THREAD_Error(ERR_THREAD_COAP_SEND_REQUEST, error);
	}
}

void sendConfigToNodes(bool record_enable) {
	portENTER_CRITICAL();
	/* Create a stream that will write to our buffer. */
	pb_ostream_t stream = pb_ostream_from_buffer(buffer, sizeof(buffer));
	/* Now we are ready to encode the message! */
	bool prevState = configPacket.payload.config_packet.enable_recording;
	configPacket.payload.config_packet.enable_recording = record_enable;
	status = pb_encode(&stream, PACKET_FIELDS, &configPacket);

	configPacket.payload.config_packet.enable_recording = prevState;
	portEXIT_CRITICAL();

	//todo: cant stop ISR's for bottom command so would be good to issue a high priority thread call for below
	APP_THREAD_CoapSendRequest(&OT_ConfigRessource,
			OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_PUT,
			MULICAST_FTD_MED,
			NULL, buffer, stream.bytes_written,
			NULL,
			NULL);

