pchwalek/buzzcam/STM32_WPAN/App/app_thread.c
}

void sendTimeToNodes(void) {
	osSemaphoreAcquire(txMsg_LockBinarySemId, osWaitForever);

	//		memset(p, NULL, sizeof(txPacket));
	/* Create a stream that will write to our buffer. */
	pb_ostream_t stream = pb_ostream_from_buffer(buffer, sizeof(buffer));
	/* Now we are ready to encode the message! */
	txPacket.which_payload = PACKET_SPECIAL_FUNCTION_TAG;
	txPacket.payload.special_function.which_payload =
			SPECIAL_FUNCTION_TIMESTAMP_TAG;
	txPacket.payload.special_function.payload.timestamp = true;
	txPacket.header.epoch = getEpoch();
	txPacket.header.ms_from_start = HAL_GetTick();
	status = pb_encode(&stream, PACKET_FIELDS, &txPacket);

	//	configPacket.which_payload = PACKET_CONFIG_PACKET_TAG;
	//		portEXIT_CRITICAL();

	//todo: cant stop ISR's for bottom command so would be good to issue a high priority thread call for below
	APP_THREAD_CoapSendRequest(&OT_ConfigRessource,
			OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_PUT,
			MULICAST_FTD_MED,
			NULL, buffer, stream.bytes_written,
			NULL,
			NULL);

	color.blue_val = 100;
	color.green_val = 100;
	color.red_val = 100;
	color.duration = 500;
	osMessageQueuePut(ledSeqQueueId, &color, 0, 0);

	osSemaphoreRelease(txMsg_LockBinarySemId);

}

void sendUWB_InfoToNode(peer_address_t *peer_addr, otIp6Address addr) {
	//	portENTER_CRITICAL();
	/* Create a stream that will write to our buffer. */
	osSemaphoreAcquire(txMsg_LockBinarySemId, osWaitForever);

	pb_ostream_t stream = pb_ostream_from_buffer(buffer, sizeof(buffer));
	/* Now we are ready to encode the message! */
	//		memset(&txPacket, NULL, sizeof(txPacket));
	txPacket.which_payload = PACKET_SPECIAL_FUNCTION_TAG;
	txPacket.has_header = true;
	txPacket.header.system_uid = LL_FLASH_GetUDN();
	txPacket.payload.special_function.which_payload =
			SPECIAL_FUNCTION_UWB_INFO_TAG;
	txPacket.payload.special_function.payload.uwb_info.has_uwb_addr = true;
	memcpy(&txPacket.payload.special_function.payload.uwb_info.uwb_addr,
			peer_addr, sizeof(peer_address_t));
	txPacket.payload.special_function.payload.uwb_info.system_uid =
			txPacket.header.system_uid;

	status = pb_encode(&stream, PACKET_FIELDS, &txPacket);
	//	portEXIT_CRITICAL();

	//todo: cant stop ISR's for bottom command so would be good to issue a high priority thread call for below
	APP_THREAD_CoapSendRequest(&OT_ConfigRessource,
			OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_PUT,
			NULL, &addr, buffer, stream.bytes_written,
			NULL,
			NULL);

	osSemaphoreRelease(txMsg_LockBinarySemId);

}

void sendUWB_InfoToNodes(peer_address_t *peer_addr) {
	//	portENTER_CRITICAL();
	/* Create a stream that will write to our buffer. */
	//	pb_ostream_t stream = pb_ostream_from_buffer(buffer, sizeof(buffer));
	/* Now we are ready to encode the message! */
	//	memset(&txPacket, NULL, sizeof(txPacket));
	osSemaphoreAcquire(txMsg_LockBinarySemId, osWaitForever);

	pb_ostream_t stream = pb_ostream_from_buffer(buffer, sizeof(buffer));

	txPacket.which_payload = PACKET_SPECIAL_FUNCTION_TAG;
	txPacket.has_header = true;
	txPacket.header.system_uid = LL_FLASH_GetUDN();
	txPacket.payload.special_function.which_payload =
			SPECIAL_FUNCTION_UWB_INFO_TAG;
	txPacket.payload.special_function.payload.uwb_info.has_uwb_addr = true;
	memcpy(&txPacket.payload.special_function.payload.uwb_info.uwb_addr,
			peer_addr, sizeof(peer_address_t));
	txPacket.payload.special_function.payload.uwb_info.system_uid =
			txPacket.header.system_uid;

	status = pb_encode(&stream, PACKET_FIELDS, &txPacket);
	//	portEXIT_CRITICAL();

	//todo: cant stop ISR's for bottom command so would be good to issue a high priority thread call for below
	APP_THREAD_CoapSendRequest(&OT_ConfigRessource,
			OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_PUT,
			MULICAST_FTD_MED,
			NULL, buffer, stream.bytes_written,
			NULL,
			NULL);

	osSemaphoreRelease(txMsg_LockBinarySemId);

}

void sendConfig(otIp6Address addr) {
	portENTER_CRITICAL();
	/* Create a stream that will write to our buffer. */
	pb_ostream_t stream = pb_ostream_from_buffer(buffer, sizeof(buffer));
	/* Now we are ready to encode the message! */
	status = pb_encode(&stream, PACKET_FIELDS, &configPacket);
	portEXIT_CRITICAL();

	//todo: cant stop ISR's for bottom command so would be good to issue a high priority thread call for below
	APP_THREAD_CoapSendRequest(&OT_ConfigRessource,
			OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_PUT,
			NULL, &addr, buffer, stream.bytes_written,
			NULL,
			NULL);

}

void alertMaster(void) {

	//	memset(&txPacket, NULL, sizeof(txPacket));
	osSemaphoreAcquire(txMsg_LockBinarySemId, osWaitForever);

	txPacket.which_payload = PACKET_SPECIAL_FUNCTION_TAG;
	txPacket.payload.special_function.which_payload =
			SPECIAL_FUNCTION_SLAVE_REQ_CONFIG_TAG;
	txPacket.payload.special_function.payload.slave_req_config = true;

	/* Create a stream that will write to our buffer. */
	pb_ostream_t stream = pb_ostream_from_buffer(buffer, sizeof(buffer));
	/* Now we are ready to encode the message! */
	status = pb_encode(&stream, PACKET_FIELDS, &txPacket);

	APP_THREAD_CoapSendRequest(&OT_ConfigRessource,
			OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_PUT,
			MULICAST_FTD_MED,
			NULL, buffer, stream.bytes_written,
			NULL,
			NULL);

	osSemaphoreRelease(txMsg_LockBinarySemId);

}

///* The callback function that will execute in the context of the daemon task.
//Note callback functions must all use this same prototype. */
//void vProcessInterface( void *pvParameter1, uint32_t ulParameter2 )
//{
//BaseType_t xInterfaceToService;
//
//    /* The interface that requires servicing is passed in the second
//    parameter.  The first parameter is not used in this case. */
//    xInterfaceToService = ( BaseType_t ) &ulParameter2(pvParameter1);
//
//    /* ...Perform the processing here... */
//}

//void createConfigThread(void *pvParameter1, uint32_t ulParameter2){
//	config_packet_t config;
//	memcpy(&config, pvParameter1, sizeof(config_packet_t));
//	osThreadState_t state = osThreadGetState(configThreadId);
//	if( (state != osThreadReady) || (state != osThreadRunning) || (state != osThreadInactive) || (state != osThreadBlocked) ){
//		configThreadId = osThreadNew(updateSystemConfig, &config, &configTask_attributes);
//	}
//}


/* returns 1 if new entry */
uint8_t addInfotoTableUWB(uwb_info_t *new_info) {
	for (int i = 0; i < MAX_CONN_COUNT; i++) {
		if (connectedNodeInfo[i].system_uid == new_info->system_uid) {
			memcpy(&connectedNodeInfo[i], new_info, sizeof(uwb_info_t));
			return UPDATE_EXISTING_ENTRY;
		} else if (connectedNodeInfo[i].system_uid == 0) {
			memcpy(&connectedNodeInfo[i], new_info, sizeof(uwb_info_t));
			return NEW_ENTRY;
		}
	}
	return MAX_UWB_DEV_REACHED;
}
/* USER CODE END FD_WRAP_FUNCTIONS */
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
